# Задача 1. На скільки років потрібно покласти в банк суму have, 
# щоб отримати суму want, якщо банк нараховує 25 % річних? 
# Вивести на екран значення суми кожного року і загальну кількість років.
# Задача2. Ускладнити задачу.
# Відсоткову ставку зробити змінною і вводити з клавіатури

# have = int(input("скільки грошей ви маєте "))
# want = int(input("скільки грошей ви хочете мати "))
# v = int(input("введіть відсоткову ставку "))
# i = 0
# while (have<=want):
#     have = round((have + have * v / 100), 2)
#     i += 1
#     print("Кількість грошей на рахунку після ", i, " років вкладень становить ", have)
    
# print("Загальна кількість років становить ", i)

# !---------------------------------------------------
# Задача 3. В учнів було S грн. В школі проходить збір макулатури. 
# Один чистий зошит коштує new грн, списаний зошит  коштує full грн. 
# Складіть алгоритм, за яким можна визначити, скільки учні зможуть купити зошитів, 
# якщо вони повертатимуть списані зошити  й на отримані гроші купуватимуть чисті?

s = 50
new = 10
full = 2
