
# Задача 1. На скільки років потрібно покласти в банк суму have,
# щоб отримати суму want, якщо банк нараховує 25% річних?
# Вивести на екран значення суми кожного року і загальну кількість років.

# 1. have = 100
# 2. have = have + 25*have/100=125
# 3. have = have + 25*have/100=///


# 57. have < want

# v = 25
# have = int(input("have = "))
# want = int(input("want = "))
# v = int(input("v = "))

# r = 0

# while have <= want:
#     have = round((have + v*have/100), 2)
#     print(have)
#     r += 1
# print(r)

